src/Catalogs/рнсПравилаПолученияДанныхИБ/рнсПравилаПолученияДанныхИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсПравилаПолученияДанныхИБ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекстЗапросаПоУмолч</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.рнсТипыРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантВыполнения</name>
    <type>
      <types>EnumRef.рнсВариантВыполненияПравила</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаПоУмолчанию</name>
    <type>
      <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.рнсГруппыДоступаРасширенныхНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКолонкиРезультата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдинственноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРаботы</name>
    <comment>0 - Стандартный, 1 - По списку настроек, 2 - Расширенный</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьСтруктуру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныеВозможностиНастроек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерФиксированногоЗапросаВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяСписокОбъектов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/рнсНастройкиПолученияЗначений/рнсНастройкиПолученияЗначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рнсНастройкиПолученияЗначений</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.рнсТипыРасширенныхНастроек</types>
    </type>
  </resources>
  <attributes>
    <name>Отключено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.рнсПравилаПолученияДанныхИБ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеВыполнения</name>
    <type>
      <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/рнсВариантВыполненияПравила/рнсВариантВыполненияПравила.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рнсВариантВыполненияПравила</name>
  <enumValues>
    <name>СхемаКомпоновки</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСОбъединением</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСУсловием</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/рнсНастройкиВыполненияПравил/рнсНастройкиВыполненияПравил.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рнсНастройкиВыполненияПравил</name>
  <basedOn>Catalog.рнсПравилаПолученияДанныхИБ</basedOn>
  <owners>Catalog.рнсПравилаПолученияДанныхИБ</owners>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметров</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененаВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеНаборы</name>
    <attributes>
      <name>ИмяНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолучитьПоПравилу</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеВнешнегоНабора</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Правило</name>
      <type>
        <types>CatalogRef.рнсПравилаПолученияДанныхИБ</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВыполнения</name>
      <type>
        <types>CatalogRef.рнсНастройкиВыполненияПравил</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыВложенныхПравил</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/рнсПравилаПолученияДанныхИБ/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	рнсОбщегоНазначения.ИнициализироватьПМФ(ЭтотОбъект); 	
	
КонецПроцедуры    

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПравилПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.СписокПравил.ТекущиеДанные;
	Если ТекущаяСтрока <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокНастроек, "Владелец", ТекущаяСтрока.Правило, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		          			
		Элементы.СписокНастроекСоздатьСписокНастроек.Видимость = ТекущаяСтрока.ВариантВыполнения = ПредопределенноеЗначение("Перечисление.рнсВариантВыполненияПравила.ЗапросСУсловием")
				ИЛИ ТекущаяСтрока.ВариантВыполнения = ПредопределенноеЗначение("Перечисление.рнсВариантВыполненияПравила.ЗапросСОбъединением");
		
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокНастроек, "Владелец", Неопределено, ВидСравненияКомпоновкиДанных.Равно,, Ложь);	
	КонецЕсли; 		
	
КонецПроцедуры  

&НаКлиенте
Процедура ПравилоПриИзменении(Элемент) 	
	ИзменитьФормуСогласноСхеме();		
КонецПроцедуры 

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьПравило(Команда)
	
	Элементы.ГруппаЗначение.Видимость 			= Ложь;
	Элементы.ГруппаСписокЗначений.Видимость 	= Ложь;
	Элементы.ГруппаТаблицаЗначений.Видимость 	= Ложь;
	Элементы.ГруппаДеревоЗначений.Видимость 	= Ложь;
	
	Значение = Неопределено;
	Порядок = Неопределено;
	
	СписокЗначений.Очистить();
	ТаблицаЗначений.Очистить();
	ДеревоЗначений.ПолучитьЭлементы().Очистить();
	
	ВыполнитьПравилоНаСервере();
	
КонецПроцедуры  

&НаКлиенте
Процедура СоздатьСписокНастроек(Команда)
	
	ТекущаяСтрока = Элементы.СписокПравил.ТекущаяСтрока;
	Если ТекущаяСтрока <> Неопределено Тогда  		
		СоздатьЗаписиРегистраНастроек(ТекущаяСтрока, Элементы.СписокНастроек.ВыделенныеСтроки);	  	
	КонецЕсли;			
	
КонецПроцедуры

&НаКлиенте
Процедура ПоРучномуСпискуНастроек(Команда)
	
	ПоРучномуСпискуНастроек 					= НЕ ПоРучномуСпискуНастроек;
	Элементы.ПоРучномуСпискуНастроек.Пометка 	= ПоРучномуСпискуНастроек;
	
	Если ПоРучномуСпискуНастроек Тогда
		Элементы.СтраницыНастройки.ТекущаяСтраница = Элементы.СтраницаСписокНастроекРучной;
	Иначе
		Элементы.СтраницыНастройки.ТекущаяСтраница = Элементы.СтраницаОдиночная;	
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ЗаполнитьПоРегистру(Команда)
	ЗаполнитьПоРегиструНаСервере();
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции   

&НаСервере
Процедура ВыполнитьПравилоНаСервере()
	
	ДопПараметры 	= Новый Структура("ПорядокЗначение", Истина);
	ПараметрыСхемы 	= Новый Структура;
	               
	СтрокиПМФ = ЭтотОбъект.КомпонентыПМФ.НайтиСтроки(Новый Структура("Раздел, ТипКомпонента", "ПараметрыСхемы", 0)); 
	Для каждого Ит Из СтрокиПМФ Цикл   
		
		Если СтрНачинаетсяС(Ит.ИмяКомпонента, "Ф_") Тогда
			Продолжить;	
		КонецЕсли;
		
		ИмяПараметра		= Прав(Ит.ИмяКомпонента, СтрДлина(Ит.ИмяКомпонента) - СтрДлина("П_"));
		ЗначениеПараметра 	= ЭтотОбъект[Ит.ИмяКомпонента];		
		
		Если ЭтотОбъект["Ф_" + ИмяПараметра] Тогда
			ПараметрыСхемы.Вставить(ИмяПараметра, ЗначениеПараметра);
		КонецЕсли;	
		
	КонецЦикла;   
	
	Если ПоРучномуСпискуНастроек Тогда 		
		
		НастройкаВыполнения = Новый МенеджерВременныхТаблиц;
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = НастройкаВыполнения;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Значение КАК Значение,
		|	Таблица.Порядок КАК Порядок,
		|	Таблица.УсловиеВыполнения КАК УсловиеВыполнения
		|ПОМЕСТИТЬ Вт_ТаблицаРучныхНастроек
		|ИЗ
		|	&Таблица КАК Таблица";
		
		Запрос.УстановитьПараметр("Таблица", СписокНастроекРучной.Выгрузить());
		Запрос.Выполнить();		
		
	Иначе
		НастройкаВыполнения = Настройка;	
	КонецЕсли;   
	
	РезультатПравила 		= Справочники.рнсПравилаПолученияДанныхИБ.ВыполнитьПравило(Правило, ПараметрыСхемы, НастройкаВыполнения, ДопПараметры);
	ТипРезультата			= ТипЗнч(РезультатПравила);  
	ЭлементРезультат	    = Неопределено;	 
	
	Если ТипРезультата = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РезультатПравила);
		ЭлементРезультат = Элементы.ГруппаЗначение;
	ИначеЕсли ТипРезультата = Тип("Массив") Тогда 
		
		Если ЗначениеЗаполнено(РезультатПравила) Тогда
			Если ТипЗнч(РезультатПравила[0]) = Тип("Структура") Тогда
				
				Таблица = Новый ТаблицаЗначений;
				Таблица.Колонки.Добавить("Значение");
				Таблица.Колонки.Добавить("Порядок");
				
				Для каждого Ит Из РезультатПравила Цикл
					НоваяСтрока 			= Таблица.Добавить();
					НоваяСтрока.Значение    = Ит.Значение;
					НоваяСтрока.Порядок     = Ит.Порядок; 						 	
				КонецЦикла;
				
				ЭлементРезультат = Элементы.ГруппаТаблицаЗначений; 
				ДобавитьКолонкиРезультата(Элементы.ТаблицаЗначений, Таблица); 					
		
				ТаблицаЗначений.Загрузить(Таблица);
				
			Иначе
				ЭлементРезультат = Элементы.ГруппаСписокЗначений;
				СписокЗначений.ЗагрузитьЗначения(РезультатПравила);
			КонецЕсли; 	
		КонецЕсли; 		
		
	ИначеЕсли ТипРезультата = Тип("ТаблицаЗначений") Тогда
		
		ЭлементРезультат = Элементы.ГруппаТаблицаЗначений;
		ДобавитьКолонкиРезультата(Элементы.ТаблицаЗначений, РезультатПравила);	
		
		ТаблицаЗначений.Загрузить(РезультатПравила); 		    		
		
	ИначеЕсли ТипРезультата = Тип("ДеревоЗначений") Тогда
				
		рнсОбщегоНазначения.СкопироватьДеревоЗначений(РезультатПравила, ДеревоЗначений);
		
		ЭлементРезультат = Элементы.ГруппаДеревоЗначений;
		ДобавитьКолонкиРезультата(Элементы.ДеревоЗначений, РезультатПравила);		
		
	Иначе
		ЭлементРезультат = Элементы.ГруппаЗначение;
		Значение = РезультатПравила;		
	КонецЕсли; 
	
	Если ЭлементРезультат <> Неопределено Тогда
		ЭлементРезультат.Видимость = Истина;	
	КонецЕсли;	
	
КонецПроцедуры  

&НаСервере
Процедура ИзменитьФормуСогласноСхеме()
	
	ПоРучномуСпискуНастроек	= Ложь;
	ИмяРазделаПараметры = "ПараметрыСхемы"; 	
	ИмяРазделаРезультат = "Результат";  
	
	рнсОбщегоНазначения.УдалитьКомпонентыРазделаПМФ(ЭтотОбъект, ИмяРазделаПараметры);
	рнсОбщегоНазначения.УдалитьКомпонентыРазделаПМФ(ЭтотОбъект, ИмяРазделаРезультат); 	 	
	
	Если ЗначениеЗаполнено(Правило) Тогда  
		
		РеквизитыПравила = Новый Структура("КоличествоНастроек", 0);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПравил.Код КАК Идентификатор,
		|	ТаблицаПравил.Наименование КАК Наименование,
		|	ТаблицаПравил.ТипЗначения КАК ТипЗначения,
		|	ТаблицаПравил.ВариантВыполнения КАК ВариантВыполнения,
		|	ТаблицаПравил.НастройкаПоУмолчанию КАК НастройкаПоУмолчанию,
		|	ТаблицаПравил.ИмяКолонкиРезультата КАК ИмяКолонкиРезультата,
		|	ТаблицаПравил.ЕдинственноеЗначение КАК ЕдинственноеЗначение,
		|	ТаблицаПравил.РежимРаботы КАК РежимРаботы,
		|	ТаблицаПравил.ИгнорироватьСтруктуру КАК ИгнорироватьСтруктуру,
		|	ТаблицаПравил.СхемаКомпоновкиДанных КАК СхемаКомпоновкиДанных,
		|	ТаблицаПравил.ТипЗначения.ТипЗначения КАК ОграничениеТипЗначения
		|ИЗ
		|	Справочник.рнсПравилаПолученияДанныхИБ КАК ТаблицаПравил
		|ГДЕ
		|	ТаблицаПравил.Ссылка = &Правило
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	рнсНастройкиПолученияЗначений.Правило КАК Правило,
		|	КОЛИЧЕСТВО(рнсНастройкиПолученияЗначений.Правило) КАК Количество
		|ИЗ
		|	РегистрСведений.рнсНастройкиПолученияЗначений КАК рнсНастройкиПолученияЗначений
		|ГДЕ
		|	рнсНастройкиПолученияЗначений.Правило = &Правило
		|	И рнсНастройкиПолученияЗначений.Правило.РежимРаботы = 1
		|
		|СГРУППИРОВАТЬ ПО
		|	рнсНастройкиПолученияЗначений.Правило
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	рнсНастройкиВыполненияПравил.Владелец,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ рнсНастройкиВыполненияПравил.Ссылка)
		|ИЗ
		|	Справочник.рнсНастройкиВыполненияПравил КАК рнсНастройкиВыполненияПравил
		|ГДЕ
		|	рнсНастройкиВыполненияПравил.Владелец = &Правило
		|	И рнсНастройкиВыполненияПравил.Владелец.РежимРаботы = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	рнсНастройкиВыполненияПравил.Владелец";
		
		Запрос.УстановитьПараметр("Правило", Правило);
		
		РезультатЗапроса 	= Запрос.ВыполнитьПакет(); 		
		ВыборкаРеквизиты 	= РезультатЗапроса[0].Выбрать();
		ВыборкаСписокПравил = РезультатЗапроса[1].Выбрать();
		
		Если ВыборкаРеквизиты.Следующий() Тогда
			Для каждого Ит Из РезультатЗапроса[0].Колонки Цикл
				РеквизитыПравила.Вставить(Ит.Имя, ВыборкаРеквизиты[Ит.Имя]);	
			КонецЦикла; 	
		КонецЕсли; 	
		
		Если ВыборкаСписокПравил.Следующий() Тогда
			РеквизитыПравила.Вставить("КоличествоНастроек", ВыборкаСписокПравил.Количество);	
		КонецЕсли; 		
		
		ПодготовитьПараметрыСхемы(ИмяРазделаПараметры, РеквизитыПравила.СхемаКомпоновкиДанных.Получить());  		
		
		Если РеквизитыПравила.РежимРаботы = 1 Тогда 
			
			Элементы.ПоРучномуСпискуНастроек.Видимость				= Истина;
			Элементы.СписокНастроекРучнойЗначение.ОграничениеТипа 	= РеквизитыПравила.ОграничениеТипЗначения;  		
			Элементы.НадписьОРаботеПоСпискуНастроек.Заголовок 		= НСтр("ru = 'Внимание! При пустых настройках правило работает по списку настроек'");
			
			СписокНастроекРучной.Очистить();		
			
		Иначе  
			Элементы.ПоРучномуСпискуНастроек.Видимость			= Ложь;
			Элементы.НадписьОРаботеПоСпискуНастроек.Заголовок 	= ""; 		
		КонецЕсли;		
		
		ОбновитьИнформациюОПравиле(РеквизитыПравила);
		
	Иначе	 
		Элементы.ПоРучномуСпискуНастроек.Видимость			= Ложь; 	
		Элементы.ИнформацияОПравиле.Заголовок 				= "";
		Элементы.НадписьОРаботеПоСпискуНастроек.Заголовок 	= "";	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПодготовитьПараметрыСхемы(ИмяРаздела, Схема)
	
	Родитель 			= Элементы.ГруппаПараметрыПравила; 
	ПараметрыДанных 	= Схема.НастройкиПоУмолчанию.ПараметрыДанных.Элементы; 
	СвойстваФлага		= Новый Структура("Вид, ПоложениеЗаголовка", ВидПоляФормы.ПолеФлажка, ПоложениеЗаголовкаЭлементаФормы.Нет); 
	
	Для каждого ОписаниеПараметра Из Схема.Параметры Цикл 	
		                       	
		ИмяРеквизита 		= "П_" + ОписаниеПараметра.Имя;
		ИмяФлага			= "Ф_" + ОписаниеПараметра.Имя;
		ПараметрКомпоновки	= Новый ПараметрКомпоновкиДанных(ОписаниеПараметра.Имя); 
		ВыделитьПараметр 	= Ложь;  
		Использовать		= Истина;
		
		СвойстваФлага.Вставить("Имя", ИмяФлага);  	
		                                   	
		Для каждого Ит Из ПараметрыДанных Цикл
			Если ПараметрКомпоновки = Ит.Параметр Тогда   
				Использовать		= Ит.Использование;
				ВыделитьПараметр 	= ЗначениеЗаполнено(Ит.ИдентификаторПользовательскойНастройки);
				Прервать;	
			КонецЕсли;	
		КонецЦикла;  
		
		ПараметрыГруппы = Новый Структура;
		ПараметрыГруппы.Вставить("Имя", "Группа" + ОписаниеПараметра.Имя);
		ПараметрыГруппы.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
		ПараметрыГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.Нет); 
		ПараметрыГруппы.Вставить("ОтображатьЗаголовок", Ложь);
		
		Если ВыделитьПараметр Тогда   
			ПараметрыГруппы.Вставить("ЦветФона", WebЦвета.СтароеКружево); 			 		
		КонецЕсли;	
		
		Если ОписаниеПараметра.ДоступенСписокЗначений Тогда
			ТипРеквизита = Новый ОписаниеТипов("СписокЗначений");	
		Иначе
			ТипРеквизита = ?(ОписаниеПараметра.ТипЗначения = Неопределено, Новый ОписаниеТипов, ОписаниеПараметра.ТипЗначения);		
		КонецЕсли;
		
		МассивРеквизитов = Новый Массив;
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита, ТипРеквизита,, ОписаниеПараметра.Заголовок)); 			
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяФлага, Новый ОписаниеТипов("Булево"))); 
		
		ИзменитьРеквизиты(МассивРеквизитов);			
		
		ГруппаПараметра = рнсОбщегоНазначения.СоздатьЭлементФормы(ЭтотОбъект, ПараметрыГруппы, Тип("ГруппаФормы"), Родитель);  	
		ПолеФлага 		= рнсОбщегоНазначения.СоздатьЭлементФормы(ЭтотОбъект, СвойстваФлага, Тип("ПолеФормы"), ГруппаПараметра);
		ПолеПараметра 	= рнсОбщегоНазначения.СоздатьЭлементФормы(ЭтотОбъект, ИмяРеквизита, Тип("ПолеФормы"), ГруппаПараметра);		  	
		
		рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, ИмяРаздела, ИмяРеквизита, 0);
		рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, ИмяРаздела, ИмяФлага, 0);
		
		рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, ИмяРаздела, ГруппаПараметра, 1);
		рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, ИмяРаздела, ПолеФлага, 1);
		рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, ИмяРаздела, ПолеПараметра, 1); 		
		 		
		Если ОписаниеПараметра.ДоступенСписокЗначений Тогда    			
			ЭтотОбъект[ИмяРеквизита].ТипЗначения = ОписаниеПараметра.ТипЗначения;	
			ЭтотОбъект[ИмяРеквизита].ЗагрузитьЗначения(ОписаниеПараметра.Значение.ВыгрузитьЗначения());
		Иначе
			ЭтотОбъект[ИмяРеквизита] = ОписаниеПараметра.Значение;	
		КонецЕсли;		
		
		ЭтотОбъект[ИмяФлага] = Использовать ИЛИ ВыделитьПараметр;
		
	КонецЦикла;	
	
КонецПроцедуры
  
&НаСервере
Процедура ДобавитьКолонкиРезультата(ТаблицаРезультат, ТаблицаСКД)   	
	
	ИмяТаблицы = ТаблицаРезультат.Имя; 
	
	Для каждого Ит Из ТаблицаСКД.Колонки Цикл
		
		ИмяРеквизита 	= Ит.Имя;   
		Отбор			= Новый Структура("ИмяКомпонента, Раздел, ПутьКДанным", ИмяРеквизита, "Результат", ИмяТаблицы);
		СтрокиПМФ 		= ЭтотОбъект.КомпонентыПМФ.НайтиСтроки(Отбор);
		                      
		Если Не ЗначениеЗаполнено(СтрокиПМФ) Тогда 			
			
			ТипКолонки = ?(Ит.ТипЗначения = Неопределено, Новый ОписаниеТипов, Ит.ТипЗначения);
			
			МассивРеквизитов = Новый Массив;
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизита, ТипКолонки, ИмяТаблицы, Ит.Заголовок)); 				
			
			ИзменитьРеквизиты(МассивРеквизитов);
			
			ОписаниеКолонки = Новый Структура("Имя, Заголовок, Вид", ИмяРеквизита, Ит.Заголовок, ВидПоляФормы.ПолеВвода);
			
			Колонка = рнсОбщегоНазначения.СоздатьЭлементФормы(ЭтотОбъект, ОписаниеКолонки, Тип("ПолеФормы"), ТаблицаРезультат); 			   
			
			рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "Результат", ИмяТаблицы + "." + ИмяРеквизита, 0); 
			рнсОбщегоНазначения.ДобавитьКомпонентРазделаПМФ(ЭтотОбъект, "Результат", Колонка, 1); 
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОПравиле(Реквизиты)
	
	Текст = СтрШаблон(НСтр("ru = 'Идентификатор: %1'"), Реквизиты.Идентификатор) + Символы.ПС; 
	Текст = Текст + СтрШаблон(НСтр("ru = 'Наименование: %1'"), Реквизиты.Наименование) + Символы.ПС;
	Текст = Текст + СтрШаблон(НСтр("ru = 'Ед. значение: %1'"), Реквизиты.ЕдинственноеЗначение) + Символы.ПС;
	Текст = Текст + СтрШаблон(НСтр("ru = 'Вариант выполнения: %1'"), Реквизиты.ВариантВыполнения) + Символы.ПС;
	Текст = Текст + СтрШаблон(НСтр("ru = 'Количество настроек: %1'"), Реквизиты.КоличествоНастроек) + Символы.ПС;
	
	Если Реквизиты.РежимРаботы = 0 Тогда
		Текст = Текст + СтрШаблон(НСтр("ru = 'Настройка по умолчанию: %1'"), Реквизиты.НастройкаПоУмолчанию) + Символы.ПС;
		Текст = Текст + СтрШаблон(НСтр("ru = 'Имя колонки: %1'"), Реквизиты.ИмяКолонкиРезультата) + Символы.ПС;
		Текст = Текст + СтрШаблон(НСтр("ru = 'Игнорировать структуру: %1'"), Реквизиты.ИгнорироватьСтруктуру) + Символы.ПС;  		
	ИначеЕсли Реквизиты.РежимРаботы = 1 Тогда 
		Текст = Текст + СтрШаблон(НСтр("ru = 'Тип значения: %1'"), Реквизиты.ТипЗначения);	
	КонецЕсли;  
	
	Элементы.ИнформацияОПравиле.Заголовок = Текст;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьЗаписиРегистраНастроек(Правило, МассивНастроек)
	
	Порядок = 10; 
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Правило, "РежимРаботы") = 1 Тогда 	
	                   		
		Для каждого Ит Из МассивНастроек Цикл
			
			Запись 							= РегистрыСведений.рнсНастройкиПолученияЗначений.СоздатьМенеджерЗаписи();  
			Запись.Правило 					= Правило;   
			Запись.Порядок 					= Порядок; 
			Запись.УсловиеВыполнения 		= Ит;
			Запись.Записать();		
			
			Порядок = Порядок + 10;
			
		КонецЦикла;		 
	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоРегиструНаСервере()	
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таблица.Порядок КАК Порядок,
		|	Таблица.УсловиеВыполнения КАК УсловиеВыполнения,
		|	Таблица.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.рнсНастройкиПолученияЗначений КАК Таблица
		|ГДЕ
		|	Таблица.Правило = &Правило
		|	И НЕ Таблица.Отключено";
	
	Запрос.УстановитьПараметр("Правило", Правило); 
	РезультатЗапроса = Запрос.Выполнить();  	
	
	СписокНастроекРучной.Загрузить(РезультатЗапроса.Выгрузить()); 		
	
КонецПроцедуры

#КонецОбласти
